imp/build/docs/runtime/style/api/NonAdminApi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-06 Thu 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Api Routes Protected By NonAdmin Auth</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Atreyee" />
<link rel="stylesheet" type="text/css" href="./style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="./style/css/override.css" />
<link rel="icon" type="image/png" href="./style/img/favicon/popl.png" />


</head>
<body>
<div id="content">
<h1 class="title">Api Routes Protected By NonAdmin Auth</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org50a75db">1. Introduction</a></li>
<li><a href="#org30fbb7f">2. Language Extensions and Imports</a></li>
<li><a href="#orgf8f28b1">3. REST</a>
<ul>
<li><a href="#org076507e">3.1. <code>/logout</code></a>
<ul>
<li><a href="#orgdc38dfe">3.1.1. API Design</a></li>
<li><a href="#org61e8174">3.1.2. Implementation</a></li>
</ul>
</li>
<li><a href="#org5b889e4">3.2. <code>/showUsers</code></a>
<ul>
<li><a href="#orgce9d5ed">3.2.1. API Design</a></li>
<li><a href="#org279bc77">3.2.2. Implementation</a></li>
</ul>
</li>
<li><a href="#org47dd94a">3.3. <code>/setName</code></a>
<ul>
<li><a href="#org4717914">3.3.1. API Design</a></li>
<li><a href="#org898f9bc">3.3.2. Implementation</a></li>
</ul>
</li>
<li><a href="#orgc4036a6">3.4. <code>/setEmail</code></a>
<ul>
<li><a href="#orgd7c26a7">3.4.1. API Design</a></li>
<li><a href="#orgf375afd">3.4.2. Implementation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org31702e2">4. API</a></li>
<li><a href="#orgd2e0411">5. Tangling</a></li>
</ul>
</div>
</div>


<div id="outline-container-org50a75db" class="outline-2">
<h2 id="org50a75db"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Defining the portion of the Api that can be accessed by <code>NonAdmin</code> users.
</p>
</div>
</div>
<div id="outline-container-org30fbb7f" class="outline-2">
<h2 id="org30fbb7f"><span class="section-number-2">2</span> Language Extensions and Imports</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-haskell" id="org2a9a195">{-# LANGUAGE DataKinds #-}
{-# LANGUAGE DeriveGeneric #-}
{-# LANGUAGE FlexibleInstances #-}
{-# LANGUAGE GeneralizedNewtypeDeriving #-}
{-# LANGUAGE MultiParamTypeClasses #-}
{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE ScopedTypeVariables #-}
{-# LANGUAGE TypeOperators #-}

module NonAdminApi where

import Prelude ()
import Prelude.Compat

import Control.Monad.Except
import Control.Monad.Reader
import Data.Aeson.Compat
import Data.Aeson.Types
import Data.Attoparsec.ByteString
import Data.ByteString (ByteString)
import Data.List
import Data.Maybe
import Data.String.Conversions
import Data.Time.Calendar
import GHC.Generics
import Lucid
import Network.HTTP.Media ((//), (/:))
import Network.Wai
import Network.Wai.Handler.Warp
import Servant
import System.Directory
import Text.Blaze
import Text.Blaze.Html.Renderer.Utf8
import qualified Data.Aeson.Parser
import qualified Text.Blaze.Html

import Data.Proxy
import Data.Text

import Database.Persist

import Models

import Servant.API
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf8f28b1" class="outline-2">
<h2 id="orgf8f28b1"><span class="section-number-2">3</span> REST</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org076507e" class="outline-3">
<h3 id="org076507e"><span class="section-number-3">3.1</span> <code>/logout</code></h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgdc38dfe" class="outline-4">
<h4 id="orgdc38dfe"><span class="section-number-4">3.1.1</span> API Design</h4>
<div class="outline-text-4" id="text-3-1-1">
<dl class="org-dl">
<dt>URL</dt><dd>/logout</dd>
<dt>Method</dt><dd>POST</dd>

<dt>Headers</dt><dd><ul class="org-ul">
<li>Content-type: application/json</li>
<li>Cookie: &lt;value&gt;</li>
</ul></dd>

<dt>Data Params</dt><dd><pre class="example">
    {
    "userId": &lt;value&gt;,
    "email" : &lt;value&gt;,
    "roles" : {
                "role" : &lt;value&gt;
              }
    }
</pre></dd>

<dt>Success Response</dt><dd><ul class="org-ul">
<li>Code: 200</li>

<li id="Content"><pre class="example">
      {"userId" : "&lt;value",
       "email"  : "&lt;value",
       "roles"  : {"role" : "&lt;value&gt;"}
      }
</pre></li>
</ul></dd>
</dl>


<dl class="org-dl">
<dt>Error Response</dt><dd><ul class="org-ul">
<li>Code: 403</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 400 Bad Request</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 500</li>
</ul></dd>

<dt>Example</dt><dd><pre class="example">
    http://localhost:8000/logout
</pre></dd>
</dl>
</div>
</div>

<div id="outline-container-org61e8174" class="outline-4">
<h4 id="org61e8174"><span class="section-number-4">3.1.2</span> Implementation</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-haskell" id="org4576675">type LogoutApi = Header "Cookie" String :&gt; "logout" :&gt; ReqBody '[JSON] Session :&gt; Post '[JSON] (Maybe (Session))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5b889e4" class="outline-3">
<h3 id="org5b889e4"><span class="section-number-3">3.2</span> <code>/showUsers</code></h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-orgce9d5ed" class="outline-4">
<h4 id="orgce9d5ed"><span class="section-number-4">3.2.1</span> API Design</h4>
<div class="outline-text-4" id="text-3-2-1">
<dl class="org-dl">
<dt>URL</dt><dd>/showUsers</dd>
<dt>Method</dt><dd>GET</dd>
<dt>Headers</dt><dd><ul class="org-ul">
<li>Cookie: &lt;session-id&gt;</li>
</ul></dd>

<dt>URL Params</dt><dd>None</dd>

<dt>Success Response</dt><dd><ul class="org-ul">
<li>Code: 200</li>

<li id="Content"><p>
list of users - name and email
</p>
<pre class="example">
    [
      {
        "name"  : &lt;value&gt;,
        "email" : &lt;value&gt;  
      }
    ]
</pre></li>
</ul></dd>

<dt>Error Response</dt><dd><ul class="org-ul">
<li>Code: 403</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 400 Bad Request</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 500</li>
</ul></dd>

<dt>Example</dt><dd><pre class="example">
    http://localhost:8000/showUsers
</pre></dd>
</dl>
</div>
</div>

<div id="outline-container-org279bc77" class="outline-4">
<h4 id="org279bc77"><span class="section-number-4">3.2.2</span> Implementation</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-haskell" id="orgeda8ddf">type ShowUsersApi = Header "Cookie" String :&gt; "showUsers" :&gt; Get '[JSON] [ShowUserData]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org47dd94a" class="outline-3">
<h3 id="org47dd94a"><span class="section-number-3">3.3</span> <code>/setName</code></h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-org4717914" class="outline-4">
<h4 id="org4717914"><span class="section-number-4">3.3.1</span> API Design</h4>
<div class="outline-text-4" id="text-3-3-1">
<dl class="org-dl">
<dt>URL</dt><dd>/setName</dd>

<dt>Method</dt><dd>POST</dd>

<dt>Data Params</dt><dd><pre class="example">
    {
    "current-data" : "soft-kitty",
    "new-data" : "warm-kitty"    
    }
</pre></dd>

<dt>Success Response</dt><dd><ul class="org-ul">
<li>Code: 200</li>

<li id="Content"><pre class="example">
    {
	"name"  : "warm-kitty",
    "email" : "soft_kitty@cat.com",
    "roles" :
              {"role":"NonAdmin"}
    }
</pre></li>
</ul></dd>

<dt>Error Response</dt><dd><ul class="org-ul">
<li>Code: 401</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 400 Bad Request</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 500</li>

<li>Content: { error : Exception String}</li>
</ul></dd>

<dt>Example</dt><dd><pre class="example">
    http://localhost:8000/setName
</pre></dd>
</dl>
</div>
</div>

<div id="outline-container-org898f9bc" class="outline-4">
<h4 id="org898f9bc"><span class="section-number-4">3.3.2</span> Implementation</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-haskell" id="orgfdbe58d">type SetNameApi = Header "Cookie" String :&gt; "setName" :&gt; ReqBody '[JSON] UpdateUserData :&gt; Post '[JSON] (Maybe (User))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc4036a6" class="outline-3">
<h3 id="orgc4036a6"><span class="section-number-3">3.4</span> <code>/setEmail</code></h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-orgd7c26a7" class="outline-4">
<h4 id="orgd7c26a7"><span class="section-number-4">3.4.1</span> API Design</h4>
<div class="outline-text-4" id="text-3-4-1">
<dl class="org-dl">
<dt>URL</dt><dd>/setEmail</dd>

<dt>Method</dt><dd>POST</dd>

<dt>Data Params</dt><dd><pre class="example">
    {
    "current-data" : "small-cat@gmail.com",
    "new-data" : "small@cat.com"    
    }
</pre></dd>

<dt>Success Response</dt><dd><ul class="org-ul">
<li>Code: 200</li>

<li id="Content"><pre class="example">
    {
	"name"  : "small-cat",
    "email" : "small@cat.com",
    "roles" :
              {"role":"NonAdmin"}
    }
</pre></li>
</ul></dd>

<dt>Error Response</dt><dd><ul class="org-ul">
<li>Code: 401</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 400 Bad Request</li>
</ul>
<p>
OR
</p>

<ul class="org-ul">
<li>Code: 500</li>

<li>Content: { error : Exception String}</li>
</ul></dd>

<dt>Example</dt><dd><pre class="example">
    http://localhost:8000/setEmail
</pre></dd>
</dl>
</div>
</div>

<div id="outline-container-orgf375afd" class="outline-4">
<h4 id="orgf375afd"><span class="section-number-4">3.4.2</span> Implementation</h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">
<pre class="src src-haskell" id="orgd68c2d4">type SetEmailApi = Header "Cookie" String :&gt; "setEmail" :&gt; ReqBody '[JSON] UpdateUserData :&gt; Post '[JSON] (Maybe (User))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org31702e2" class="outline-2">
<h2 id="org31702e2"><span class="section-number-2">4</span> API</h2>
<div class="outline-text-2" id="text-4">
<p>
Combining the above APIs into one type.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org905add0">type NonAdminRoutes = ShowUsersApi :&lt;|&gt; LogoutApi :&lt;|&gt; SetNameApi :&lt;|&gt; SetEmailApi
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2e0411" class="outline-2">
<h2 id="orgd2e0411"><span class="section-number-2">5</span> Tangling</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-haskell">&lt;&lt;extns_and_imports&gt;&gt;
&lt;&lt;show_users&gt;&gt;
&lt;&lt;logout&gt;&gt;
&lt;&lt;set_name&gt;&gt;
&lt;&lt;set_email&gt;&gt;
&lt;&lt;non_admin_routes&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Atreyee</p>
<p class="date">Created: 2017-07-06 Thu 16:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
